<a href="https://colab.research.google.com/github/N-Daiya/DeepLearning/blob/HW/Assignment_9_DL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import os
import datetime

import IPython
import IPython.display
import matplotlib as mpl
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
import tensorflow as tf

mpl.rcParams['figure.figsize'] = (8, 6)
mpl.rcParams['axes.grid'] = False

In [2]:
!wget -O AirQualityUCI.zip https://archive.ics.uci.edu/ml/machine-learning-databases/00360/AirQualityUCI.zip
!unzip AirQualityUCI.zip

--2020-10-27 06:24:37--  https://archive.ics.uci.edu/ml/machine-learning-databases/00360/AirQualityUCI.zip
Resolving archive.ics.uci.edu (archive.ics.uci.edu)... 128.195.10.252
Connecting to archive.ics.uci.edu (archive.ics.uci.edu)|128.195.10.252|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1543989 (1.5M) [application/x-httpd-php]
Saving to: ‘AirQualityUCI.zip’

AirQualityUCI.zip   100%[===================>]   1.47M  3.74MB/s    in 0.4s

2020-10-27 06:24:37 (3.74 MB/s) - ‘AirQualityUCI.zip’ saved [1543989/1543989]

Archive:  AirQualityUCI.zip
replace AirQualityUCI.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: AirQualityUCI.csv
replace AirQualityUCI.xlsx? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: AirQualityUCI.xlsx

In [3]:
data=pd.read_csv('/content/AirQualityUCI.csv',sep=';')

In [4]:
data.head(5)

         Date      Time CO(GT)  ...      AH  Unnamed: 15 Unnamed: 16
0  10/03/2004  18.00.00    2,6  ...  0,7578          NaN         NaN
1  10/03/2004  19.00.00      2  ...  0,7255          NaN         NaN
2  10/03/2004  20.00.00    2,2  ...  0,7502          NaN         NaN
3  10/03/2004  21.00.00    2,2  ...  0,7867          NaN         NaN
4  10/03/2004  22.00.00    1,6  ...  0,7888          NaN         NaN

[5 rows x 17 columns]

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9471 entries, 0 to 9470
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   object
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   object
 3   PT08.S1(CO)    9357 non-null   float64
 4   NMHC(GT)       9357 non-null   float64
 5   C6H6(GT)       9357 non-null   object
 6   PT08.S2(NMHC)  9357 non-null   float64
 7   NOx(GT)        9357 non-null   float64
 8   PT08.S3(NOx)   9357 non-null   float64
 9   NO2(GT)        9357 non-null   float64
 10  PT08.S4(NO2)   9357 non-null   float64
 11  PT08.S5(O3)    9357 non-null   float64
 12  T              9357 non-null   object
 13  RH             9357 non-null   object
 14  AH             9357 non-null   object
 15  Unnamed: 15    0 non-null      float64
 16  Unnamed: 16    0 non-null      float64
dtypes: float64(10), object(7)
memory usage: 1.2+ MB

In [6]:
data=data.drop(['Unnamed: 15','Unnamed: 16'],axis=1)

In [7]:
data.isnull().sum()

Date             114
Time             114
CO(GT)           114
PT08.S1(CO)      114
NMHC(GT)         114
C6H6(GT)         114
PT08.S2(NMHC)    114
NOx(GT)          114
PT08.S3(NOx)     114
NO2(GT)          114
PT08.S4(NO2)     114
PT08.S5(O3)      114
T                114
RH               114
AH               114
dtype: int64

In [8]:
null_data=data[data.isnull().any(axis=1)]
null_data.head()

     Date Time CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)    T   RH   AH
9357  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9358  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9359  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9360  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN
9361  NaN  NaN    NaN          NaN  ...          NaN  NaN  NaN  NaN

[5 rows x 15 columns]

In [9]:
data=data.dropna()
data.shape

(9357, 15)

In [10]:
data.describe()

       PT08.S1(CO)     NMHC(GT)  ...  PT08.S4(NO2)  PT08.S5(O3)
count  9357.000000  9357.000000  ...   9357.000000  9357.000000
mean   1048.990061  -159.090093  ...   1391.479641   975.072032
std     329.832710   139.789093  ...    467.210125   456.938184
min    -200.000000  -200.000000  ...   -200.000000  -200.000000
25%     921.000000  -200.000000  ...   1185.000000   700.000000
50%    1053.000000  -200.000000  ...   1446.000000   942.000000
75%    1221.000000  -200.000000  ...   1662.000000  1255.000000
max    2040.000000  1189.000000  ...   2775.000000  2523.000000

[8 rows x 8 columns]

In [11]:
data=data.replace(-200,np.nan)
data.describe()

       PT08.S1(CO)     NMHC(GT)  ...  PT08.S4(NO2)  PT08.S5(O3)
count  8991.000000   914.000000  ...   8991.000000  8991.000000
mean   1099.833166   218.811816  ...   1456.264598  1022.906128
std     217.080037   204.459921  ...    346.206794   398.484288
min     647.000000     7.000000  ...    551.000000   221.000000
25%     937.000000    67.000000  ...   1227.000000   731.500000
50%    1063.000000   150.000000  ...   1463.000000   963.000000
75%    1231.000000   297.000000  ...   1674.000000  1273.500000
max    2040.000000  1189.000000  ...   2775.000000  2523.000000

[8 rows x 8 columns]

In [12]:
data.isnull().sum()

Date                0
Time                0
CO(GT)              0
PT08.S1(CO)       366
NMHC(GT)         8443
C6H6(GT)            0
PT08.S2(NMHC)     366
NOx(GT)          1639
PT08.S3(NOx)      366
NO2(GT)          1642
PT08.S4(NO2)      366
PT08.S5(O3)       366
T                   0
RH                  0
AH                  0
dtype: int64

In [13]:
data.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            9347, 9348, 9349, 9350, 9351, 9352, 9353, 9354, 9355, 9356],
           dtype='int64', length=9357)

In [14]:
data.loc[:,'Datetime']=data['Date']+' '+data['Time']

In [15]:
from datetime import datetime
DateTime = []

In [16]:
for x in data['Datetime']:
    DateTime.append(datetime.strptime(x,'%d/%m/%Y %H.%M.%S'))

In [17]:
datetime=pd.Series(DateTime)
data.index=datetime

In [18]:
data.head()

                           Date      Time  ...      AH             Datetime
2004-03-10 18:00:00  10/03/2004  18.00.00  ...  0,7578  10/03/2004 18.00.00
2004-03-10 19:00:00  10/03/2004  19.00.00  ...  0,7255  10/03/2004 19.00.00
2004-03-10 20:00:00  10/03/2004  20.00.00  ...  0,7502  10/03/2004 20.00.00
2004-03-10 21:00:00  10/03/2004  21.00.00  ...  0,7867  10/03/2004 21.00.00
2004-03-10 22:00:00  10/03/2004  22.00.00  ...  0,7888  10/03/2004 22.00.00

[5 rows x 16 columns]

In [19]:
data.dtypes

Date              object
Time              object
CO(GT)            object
PT08.S1(CO)      float64
NMHC(GT)         float64
C6H6(GT)          object
PT08.S2(NMHC)    float64
NOx(GT)          float64
PT08.S3(NOx)     float64
NO2(GT)          float64
PT08.S4(NO2)     float64
PT08.S5(O3)      float64
T                 object
RH                object
AH                object
Datetime          object
dtype: object

In [20]:
data['CO(GT)']=data['CO(GT)'].str.replace(',','.').astype(float)
data['C6H6(GT)']=data['C6H6(GT)'].str.replace(',','.').astype(float)
data['T']=data['T'].str.replace(',','.').astype(float)
data['RH']=data['RH'].str.replace(',','.').astype(float)
data['AH']=data['AH'].str.replace(',','.').astype(float)

In [21]:
data.describe()

            CO(GT)  PT08.S1(CO)  ...           RH           AH
count  9357.000000  8991.000000  ...  9357.000000  9357.000000
mean    -34.207524  1099.833166  ...    39.485380    -6.837604
std      77.657170   217.080037  ...    51.216145    38.976670
min    -200.000000   647.000000  ...  -200.000000  -200.000000
25%       0.600000   937.000000  ...    34.100000     0.692300
50%       1.500000  1063.000000  ...    48.600000     0.976800
75%       2.600000  1231.000000  ...    61.900000     1.296200
max      11.900000  2040.000000  ...    88.700000     2.231000

[8 rows x 13 columns]

In [22]:
data = data.replace(-200, np.nan)

In [23]:
S1 = data['PT08.S1(CO)'].fillna(data['PT08.S1(CO)'].mean())
S2 = data['PT08.S2(NMHC)'].fillna(data['PT08.S1(CO)'].mean())
S3 = data['PT08.S3(NOx)'].fillna(data['PT08.S1(CO)'].mean())
S4 = data['PT08.S4(NO2)'].fillna(data['PT08.S1(CO)'].mean())
S5 = data['PT08.S5(O3)'].fillna(data['PT08.S1(CO)'].mean())

In [24]:
df = pd.DataFrame({'S1':S1, 'S2':S1, 'S3':S3, 'S4':S4, 'S5':S5})
df.to_csv("AirQuality_processed.csv")